/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sunghoch <sunghoch@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/03/21 17:20:23 by sunghoch          #+#    #+#             */
/*   Updated: 2023/03/28 18:10:50 by sunghoch         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int	ft_isalnum(int c)
{
	if (48 <= c && c <= 57)
		return (4);
	else if (65 <= c && c <= 90)
		return (1);
	else if (97 <= c && c <= 122)
		return (2);
	else
		return (0);
}
/*
인자의 아스키코드가 숫자인 경우, 4를 반환
인자의 아스키코드가 대문자인 경우, 1을 반환
인자의 아스키코드가 소문자인 경우, 2를 반환
그 외의 경우, 0을 반환
*/