/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstlast.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sunghoch <sunghoch@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/04/05 21:12:09 by sunghoch          #+#    #+#             */
/*   Updated: 2023/04/05 21:44:21 by sunghoch         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

t_list	*ft_lstlast(t_list *lst)
{//연결리스트의 맨 뒤 노드를 반환하는 함수
	if (!lst)//연결리스트가 비어있을 경우 NULL 반환
		return (0);
	while (lst->next) //연결리스트의 맨 뒤로 이동 후 반환
		lst = lst->next;
	return (lst);
}
