/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sunghoch <sunghoch@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/03/26 16:28:55 by sunghoch          #+#    #+#             */
/*   Updated: 2023/04/05 19:56:26 by sunghoch         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

char	*ft_strchr(const char *s, int c)
{
//문자열 s에서 문자 c가 처음으로 나타나는 위치를 반환하는 함수
	int	i;

	i = 0;
	while (s[i])
	{
		if (s[i] == (char)c) //문자 c가 나타나면 해당 위치를 반환
			return ((char *)&s[i]);
		i++;
	}
	if (s[i] == (char)c) //문자열이 끝났어도, c가 혹여 NULL문자인 경우을 위해 한번 더 검사
		return ((char *)&s[i]);
	return (0);
}